< [Online Version Python Data Science Handbook](https://github.com/jakevdp/PythonDataScienceHandbook)| [Index](https://github.com/lsalamo/python-training/blob/master/PythonDataScienceHandbook/Index.ipynb)>
# 3.1. Introducing Pandas Objects
* Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.
* There are three fundamental Pandas data structures: the **Series, DataFrame, and Index**.

### The Pandas Series Object

A Pandas Series is a one-dimensional array of indexed data.

In [4]:
import numpy as np
import pandas as pd

In [11]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=[0, 1, 2, 3])
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['0', '1', '2', '3'])
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=list('0123'))
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [10]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
data[1]

0.5

In [13]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [72]:
# Series as generalized NumPy array
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [15]:
data['b']

0.5

In [73]:
# Series as specialized dictionary
data = {'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135}
data = pd.Series(data).sort_index()
data

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [29]:
data['California']

38332521

In [32]:
data['California':'Illinois']

California    38332521
Florida       19552860
Illinois      12882135
dtype: int64

### The Pandas DataFrame Object

In [109]:
pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [139]:
pd.DataFrame(
    np.array([
        ["A0", "A1", "A2", "A3"],
        ["B0", "B1", "B2", "B3"],
        ["C0", "C1", "C2", "C3"],
        ["D0", "D1", "D2", "D3"]
    ]),
    index=[0, 1, 2, 3],
    columns=['A', 'B', 'C', 'D']
)

    A   B   C   D
0  A0  A1  A2  A3
1  B0  B1  B2  B3
2  C0  C1  C2  C3
3  D0  D1  D2  D3

In [23]:
df = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
    }
)

In [12]:
df.dtypes
#type(df["E"])

A            object
B    datetime64[ns]
C           float32
D             int32
E          category
dtype: object

In [17]:
df.shape

(4, 5)

In [22]:
 df["A"].shape

(4,)

In [25]:
# total rows
len(df.index)
df.shape[0]
df[df.columns[0]].count()

4

In [27]:
df.head(2)

    A          B    C  D      E
0  A0 2013-01-02  1.0  3   test
1  A1 2013-01-02  1.0  3  train

In [15]:
df.tail(2)

    A          B    C  D      E
2  A2 2013-01-02  1.0  3   test
3  A3 2013-01-02  1.0  3  train

In [16]:
df.describe()

         C    D
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

## Columns

In [7]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [8]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [34]:
df.A is df['A']

True

### Columns - Cast

In [21]:
#https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.astype.html
# by date > 
#     df = df.astype({'from_date': 'datetime64', 'to_date': 'datetime64'})
#     df = df.astype({'from_date': 'datetime64[ns]'})
#     df['from_date'] = df['from_date'].astype('datetime64[ns]')
#     df['from_date'] = pd.to_datetime(df["from_date"])
#     df['from_date'] = pd.to_datetime(df['from_date']).dt.strftime('%Y-%m-%d %H:%M:%S') > string
#     df['from_date'] = pd.to_datetime(pd.to_datetime(df['from_date']).dt.strftime('%Y-%m-%d %H:%M:%S')) > datetime
df["B_NEW"] = pd.to_datetime(df["B_NEW"])
df = df.astype({'B_NEW': 'datetime64[ns, UTC]'})
df['Date'] = df['Date'].astype('datetime64[ns]')
df["B_NEW"].dtypes

datetime64[ns, UTC]

In [101]:
# DataFrame as a generalized NumPy array
population_dict = {'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135}
population = pd.Series(population_dict)
area_dict = {'California': 423967, 
    'Texas': 695662, 
    'New York': 141297,
    'Florida': 170312, 
    'Illinois': 149995}
area = pd.Series(area_dict)
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [88]:
# Rename columns
states.columns = ['$a', '$b']
states_rename_cols = states.copy(); states_rename_cols.columns = ['$a', '$b'];
states_rename_cols = pd.DataFrame({'$a':states.population, '$b': states.area})
states_rename_cols = states.rename(columns={'population':'$a', 'area':'$b'}, inplace = False) #inplace a false no sobreescribe el df
states_rename_cols = states.rename({'population':'$a', 'area':'$b'}, axis='columns', inplace = False)
states_rename_cols = states.set_axis(['$a', '$b'], axis='columns', inplace = False)
states_rename_cols

                  $a      $b
California  38332521  423967
Texas       26448193  695662
New York    19651127  141297
Florida     19552860  170312
Illinois    12882135  149995

In [99]:
# Rename columns with lambda expressions 
states.rename(columns=lambda s: s + "_")
states.rename(columns=lambda s: s.upper())
os_list = ['test1', 'test2', 'area']; states.rename(columns=lambda x: x +'x' if x in os_list else x, inplace = False)
states.rename(columns=lambda s: s[1:])
states.rename(columns=lambda s: s.replace("a", "X"))
states.rename(columns=lambda s: s.replace("a", "X"))

            populXtion    XreX
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [42]:
pd.DataFrame(states)

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [9]:
# DataFrame as specialized dictionary
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [100]:
# From a single Series object
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [65]:
# From a list of dicts
data = [{'a': i, 'b': 2 * i} 
    for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [67]:
# Even if some keys in the dictionary are missing, Pandas will fill them in with NaN (i.e., "not a number") values:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [69]:
# From a dictionary of Series objects
pd.DataFrame({'population': population,
    'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [71]:
# From a two-dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2),
    columns=['foo', 'bar'],
    index=['a', 'b', 'c'])

        foo       bar
a  0.467173  0.452714
b  0.858869  0.316503
c  0.197929  0.044483

### The Pandas Index Object